[
  {
    "title": "Novak Djokovic withdraws from Monte Carlo Masters due to injury",
    "description": "World number one Novak Djokovic has officially withdrawn from the Monte Carlo Masters due to a persistent injury in his right wrist. The Serbian tennis star, who was hoping to kick off his clay court season with strong performances, announced the news after consulting with his medical team. The extent of the injury raises concerns about his participation in other key tournaments during the clay season, including the upcoming Madrid and Rome Masters, and potentially Roland Garros. Djokovic expressed disappointment but emphasized the importance of recovery and returning to full fitness before resuming competition.",
    "image": "https://media.philstar.com/photos/2024/04/10/novak-djokovic-tennis_2024-04-10_12-15-12.jpg",
    "source": "https://www.marca.com"
  },
  {
    "title": "Max Verstappen wins fifth consecutive F1 race",
    "description": "Max Verstappen continued his unstoppable streak by clinching his fifth straight victory of the 2025 Formula 1 season at the Japanese Grand Prix. The Dutch driver displayed exceptional control and speed throughout the race, maintaining his lead despite pressure from rivals. Red Bull Racing celebrated another dominant weekend, reinforcing Verstappen’s strong grip on the championship standings. His consistent performances have left fans and analysts wondering if he is heading toward one of the most dominant seasons in F1 history.",
    "image": "https://ca-times.brightspotcdn.com/dims4/default/8d116a1/2147483647/strip/true/crop/8640x5760+0+0/resize/1200x800!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe8%2Fd0%2F8ce42b5d4b40a2f10e17967d1bab%2Faustria-f1-gp-auto-racing-95867.jpg",
    "source": "https://www.formula1.com"
  },
  {
    "title": "Giannis Antetokounmpo leads historic Bucks blowout",
    "description": "Giannis Antetokounmpo delivered a jaw-dropping performance with 48 points and 14 rebounds, propelling the Milwaukee Bucks to a historic 56-point victory over the Charlotte Hornets. This marks the largest margin of victory in the NBA this season. The Greek Freak's dominance on both ends of the floor energized the crowd and reminded the league of his unstoppable skill set. With this statement win, the Bucks have reasserted themselves as top contenders in the Eastern Conference.",
    "image": "https://theplayoffs.news/en/wp-content/uploads/2025/03/Giannis-Antetokounmpo-20000-career-points.jpg",
    "source": "https://www.espn.com"
  },
  {
    "title": "Simone Biles secures spot for Paris 2024 Olympics",
    "description": "Four-time Olympic gold medalist Simone Biles has officially secured her spot on the United States Olympic gymnastics team after an outstanding performance at the national qualifiers. Her routines were met with standing ovations, showcasing not only her technical precision but also her unwavering determination after taking a break from competition. The Paris 2024 Games will be her third Olympic appearance, and fans around the world are eagerly anticipating her return to the global stage.",
    "image": "https://d.newsweek.com/en/full/2419955/simone-biles.jpg?w=1200&f=98e4b4801b7877dbca82c8ab5a79745c",
    "source": "https://www.olympics.com"
  },
  {
    "title": "Argentina’s Pumas stun All Blacks with dramatic comeback",
    "description": "In one of the most thrilling matches of the Rugby Championship, Argentina's national team, the Pumas, stunned rugby powerhouse New Zealand with a 29–28 comeback win. Trailing in the final 10 minutes, the Argentinians turned the game around with a combination of resilience, sharp tactics, and a last-minute try that electrified fans. This victory marks a historic moment for Argentine rugby and reignites hopes for a strong campaign in upcoming international fixtures.",
    "image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1oyRzx.img?w=768&h=512&m=6&x=38&y=115&s=482&d=133",
    "source": "https://www.clarin.com"
  },
  {
    "title": "Carlos Alcaraz wins back-to-back Barcelona titles",
    "description": "Rising tennis sensation Carlos Alcaraz has once again proven his mettle by successfully defending his ATP 500 Barcelona title. In a high-energy final against Stefanos Tsitsipas, the Spanish player demonstrated remarkable agility and mental toughness, earning his second trophy of the season. His back-to-back victory in Barcelona cements his status as one of the brightest young talents on the ATP Tour and a serious contender for upcoming Grand Slam events.",
    "image": "https://static.toiimg.com/thumb/msid-99712920,width-1280,height-720,resizemode-4/99712920.jpg",
    "source": "https://www.atptour.com"
  },
  {
    "title": "Los Angeles Lakers fire head coach Darvin Ham",
    "description": "Following a season marked by underperformance and inconsistency, the Los Angeles Lakers have parted ways with head coach Darvin Ham. Despite early hopes of a championship run, the team failed to meet expectations and struggled to find a cohesive playing style. Management is now actively exploring options for a new head coach to lead the franchise into the next chapter. Several notable candidates are being considered as the Lakers aim to rebuild their competitive edge.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap24122131872882.jpg?c=original",
    "source": "https://www.nba.com"
  },
  {
    "title": "FIFA confirms new 32-team format for 2025 Club World Cup",
    "description": "FIFA has officially announced a revamped format for the 2025 Club World Cup, which will now feature 32 teams from across the globe. Set to be hosted in the United States, the expanded tournament aims to provide a more competitive and globally inclusive experience for clubs and fans alike. The decision is seen as a major step in the evolution of international club football, with high expectations for commercial and sporting success.",
    "image": "https://i.dailymail.co.uk/1s/2022/12/16/10/65651421-11545701-image-a-8_1671187880960.jpg",
    "source": "https://www.fifa.com"
  },
  {
    "title": "Argentina, Uruguay, Paraguay bid for 2030 World Cup",
    "description": "Argentina has officially launched a joint bid with Uruguay and Paraguay to host the 2030 FIFA World Cup. This bid aims to commemorate the 100th anniversary of the inaugural World Cup, which took place in Montevideo in 1930. The proposal has gained strong regional and historical significance, with support from football federations and governments. If successful, it would bring the tournament back to South America for the first time in over a decade.",
    "image": "https://fotos.perfil.com/2023/02/07/trim/1140/641/argentina-world-cup-bid-1505341.jpg",
    "source": "https://www.tycsports.com"
  },
  {
    "title": "Thomas Müller announces Bayern Munich departure",
    "description": "German football legend Thomas Müller has announced that he will leave Bayern Munich at the end of the 2024–2025 season. With a career spanning more than a decade at the club, Müller has become a symbol of consistency, leadership, and excellence. His departure marks the end of an era for both the player and the club, and fans are preparing to bid farewell to one of the most iconic figures in Bayern’s rich history.",
    "image": "https://tse4.mm.bing.net/th?id=OIP.EGYsYTp7YhRlyxFveWkc0QHaE8&pid=Api",
    "source": "https://as.com/futbol/internacional/muller-fin-de-ciclo-n"
  },
  {
    "title": "Federico Chiesa may return to Serie A from Liverpool",
    "description": "Federico Chiesa's future at Liverpool is uncertain as he has found limited playing time under the current system. Reports suggest that the Italian winger could be loaned out in the next transfer window, with Serie A clubs AC Milan and AS Roma expressing interest in bringing him back to Italy. A potential move could help Chiesa regain form and minutes ahead of key international tournaments.",
    "image": "https://tse3.mm.bing.net/th?id=OIP.hUVfH9ZWVa29sgRhgXHKgAHaEK&pid=Api",
    "source": "https://www.fichajes.net/noticias/liverpool-busca-cesion-chiesa-3-clubes-interesados-20241024.html"
  },
  {
    "title": "El Clásico to decide 2025 Copa del Rey champions",
    "description": "Spanish giants Real Madrid and Barcelona are set to clash in the 2025 Copa del Rey final on April 26th at La Cartuja Stadium in Seville. With both teams in top form and a historic rivalry between them, expectations are high for a thrilling and dramatic encounter. The match promises to be a spectacle for fans around the world, as two of football’s most successful clubs battle for domestic glory.",
    "image": "https://tse2.mm.bing.net/th?id=OIF.HMm8XtWlyNNPH4TYintp2w&pid=Api",
    "source": "https://es.wikipedia.org/wiki/Final_de_la_Copa_del_Rey_de_fútbol_2024-25"
  },
  {
    "title": "Santa Cruz de la Sierra to host 2025 Copa Sudamericana final",
    "description": "For the first time in the tournament’s history, Santa Cruz de la Sierra, Bolivia, will host the final match of the Copa Sudamericana. Scheduled for November 22, 2025, the single-match final will be played in a stadium yet to be confirmed. This marks a major milestone for Bolivian football and reflects CONMEBOL's efforts to diversify hosting locations across South America.",
    "image": "https://tse4.mm.bing.net/th?id=OIF.J02vrw0QdkPwkq882eYHZA&pid=Api",
    "source": "https://es.wikipedia.org/wiki/Copa_Sudamericana_2025"
  },
  {
    "title": "Belgium to host 2025 European Road Athletics Championships",
    "description": "Brussels and Leuven will co-host the inaugural European Road Athletics Championships, taking place on April 12–13, 2025. The event will feature top athletes from across Europe competing in 5K, 10K, and half-marathon races. As the first edition of this championship, it is expected to attract large crowds and media attention, solidifying Belgium's role as a key host in the European athletics calendar.",
    "image": "https://tse1.mm.bing.net/th?id=OIP.sCM_an4SSvoVKbS1TB4rJwHaE8&pid=Api",
    "source": "https://es.wikipedia.org/wiki/Campeonato_Europeo_de_Atletismo_en_Ruta_de_2025"
  },
  {
    "title": "Inter Miami beats LA Galaxy with Leo Messi's goal",
    "description": "Lionel Messi was once again the hero for Inter Miami, scoring a stoppage-time goal to seal a 2–1 victory over the LA Galaxy in the MLS. The match, played at DRV PNK Stadium, was vibrant and hard-fought, with chances for both teams. Messi, who had been playing a quiet game until the end, took advantage of a through ball from Sergio Busquets to finish with class past the opposing goalkeeper. The victory keeps the Florida team at the top of the Eastern Conference and reinforces the Argentine star's impact in the American league.",
    "image": "https://images.mlssoccer.com/image/private/t_editorial_landscape_8_desktop_mobile/mls/nwfp6ktqrv6lih5c1cgi.jpg",
    "source": "https://www.mlssoccer.com"
  }
]